benchmark/Qwen3.5-122B-A10B-NVFP4_bench_mtp.txt
1x 124000 in 512 out

Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ca2ef206ac0>, trust_remote_code=True, seed=0, num_prompts=1, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=124000, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='local-llm', input_len=None, output_len=None, tokenizer='Sehyo/Qwen3.5-122B-A10B-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-2e28aa8d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 03-22 08:58:46 [datasets.py:703] Sampling input_len from [124000, 124000] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 1/1 [00:29<00:00, 29.32s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1         
Failed requests:                         0         
Benchmark duration (s):                  29.32     
Total input tokens:                      124000    
Total generated tokens:                  512       
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         17.46     
Peak output token throughput (tok/s):    46.00     
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          4245.99   
---------------Time to First Token----------------
Mean TTFT (ms):                          25633.90  
Median TTFT (ms):                        25633.90  
P99 TTFT (ms):                           25633.90  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.22      
Median TPOT (ms):                        7.22      
P99 TPOT (ms):                           7.22      
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.71     
Median ITL (ms):                         21.83     
P99 ITL (ms):                            26.37     
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.84     
Acceptance length:                       2.98      
Drafts:                                  172       
Draft tokens:                            344       
Accepted tokens:                         340       
Per-position acceptance (%):
  Position 0:                            98.84     
  Position 1:                            98.84     
==================================================


1x 240000 in 512 out

Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c939caf6ac0>, trust_remote_code=True, seed=0, num_prompts=1, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=240000, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='local-llm', input_len=None, output_len=None, tokenizer='Sehyo/Qwen3.5-122B-A10B-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-43ef4acc-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 03-22 08:59:56 [datasets.py:703] Sampling input_len from [240000, 240000] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 1/1 [01:00<00:00, 60.10s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1         
Failed requests:                         0         
Benchmark duration (s):                  60.10     
Total input tokens:                      240000    
Total generated tokens:                  512       
Request throughput (req/s):              0.02      
Output token throughput (tok/s):         8.52      
Peak output token throughput (tok/s):    44.00     
Peak concurrent requests:                1.00      
Total token throughput (tok/s):          4001.66   
---------------Time to First Token----------------
Mean TTFT (ms):                          56232.69  
Median TTFT (ms):                        56232.69  
P99 TTFT (ms):                           56232.69  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.57      
Median TPOT (ms):                        7.57      
P99 TPOT (ms):                           7.57      
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.90     
Median ITL (ms):                         23.06     
P99 ITL (ms):                            24.11     
---------------Speculative Decoding---------------
Acceptance rate (%):                     97.13     
Acceptance length:                       2.94      
Drafts:                                  174       
Draft tokens:                            348       
Accepted tokens:                         338       
Per-position acceptance (%):
  Position 0:                            97.13     
  Position 1:                            97.13     
==================================================


2x 124000 in 512 out

Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70e4f3bfede0>, trust_remote_code=True, seed=0, num_prompts=2, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=124000, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='local-llm', input_len=None, output_len=None, tokenizer='Sehyo/Qwen3.5-122B-A10B-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-4e21c8c9-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 03-22 09:01:48 [datasets.py:703] Sampling input_len from [124000, 124000] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 2/2 [02:26<00:00, 73.44s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     2         
Failed requests:                         0         
Benchmark duration (s):                  146.88    
Total input tokens:                      248000    
Total generated tokens:                  1024      
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         6.97      
Peak output token throughput (tok/s):    44.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          1695.39   
---------------Time to First Token----------------
Mean TTFT (ms):                          84812.71  
Median TTFT (ms):                        84812.71  
P99 TTFT (ms):                           141764.90 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          107.87    
Median TPOT (ms):                        107.87    
P99 TPOT (ms):                           206.01    
---------------Inter-token Latency----------------
Mean ITL (ms):                           314.99    
Median ITL (ms):                         23.37     
P99 ITL (ms):                            1166.30   
---------------Speculative Decoding---------------
Acceptance rate (%):                     95.33     
Acceptance length:                       2.91      
Drafts:                                  353       
Draft tokens:                            706       
Accepted tokens:                         673       
Per-position acceptance (%):
  Position 0:                            96.60     
  Position 1:                            94.05     
==================================================